### Pandas DataFrame exersizes = https://www.w3resource.com/python-exercises/pandas/index-dataframe.php

In [1]:
import pandas as pd
import numpy as np

##### 7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [110]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data=exam_data, index=labels)
df_ex = df[df['attempts'] > 2]
df_ex

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

##### 8. Write a Pandas program to count the number of rows and columns of a DataFrame.

In [8]:
print(f'Rows: {df.shape[0]}, columns: {df.shape[1]}')

Rows: 10, columns: 4

##### 9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [37]:
df_score_nan = df[np.isnan(df['score'])]
df_score_nan

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

##### 10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [39]:
df_highscore = df[(df['score'] >= 15) & (df['score'] <= 20)]
df_highscore

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

##### 11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [40]:
df_2 = df[(df['attempts'] < 2) & (df['score'] > 15)]
df_2

    name  score  attempts qualify
j  Jonas   19.0         1     yes

##### 12. Write a Pandas program to change the score in row 'd' to 11.5.

In [54]:
df.replace(df['score']['d'], 11.5)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

##### 13. Write a Pandas program to calculate the sum of the examination attempts by the students.

In [57]:
df_sum = df['attempts'].sum()
df_sum

19

##### 14. Write a Pandas program to calculate the mean score for each different student in DataFrame.

In [106]:
# Resetting the score in row D
df = df.replace(df['score']['d'], np.nan)

df_mean = df.mean(numeric_only=True)['score']
df_mean

13.5625

##### 15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.

In [121]:
news = pd.Series(['Suresh', 15.5, 1, 'yes'], index=['name', 'score', 'attempts', 'qualify'])
df.loc['k'] = news
print(df)
df.drop(labels=['k'], inplace=True)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes